tutorials/fluidSolidInteraction/HronTurekFsi3/laminar/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    plate
    {
        type extrapolatedPressure;
        value uniform 0;
    }
    outlet
    {
        type fixedValue;
        value uniform 0;
    }
    inlet
    {
        type extrapolatedPressure;
        value uniform 0;
    }
    cylinder
    {
        type extrapolatedPressure;
        value uniform 0;
    }
    bottom
    {
        type extrapolatedPressure;
        value uniform 0;
    }
    top
    {
        type extrapolatedPressure;
        value uniform 0;
    }
    frontAndBackPlanes
    {
        type empty;
    }
}


// ************************************************************************* //
